Revit 2027 API
TableSectionData.SetColumnWidthInPixels Method
 This sets a column's width in logical pixels
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColumnWidthInPixels(
	int nCol,
	int width
)
Public Sub SetColumnWidthInPixels (
	nCol As Integer,
	width As Integer
)
public:
void SetColumnWidthInPixels(
	int nCol,
	int width
)
member SetColumnWidthInPixels :
        nCol : int *
        width : int -> unit
Parameters
nCol Int32
width Int32
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid. -or- The column width is outside of acceptable range.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace